{
    "users":[],
    "classes":[
        {
            "id":1,
            "name":"Sorcière",
            "description":"La sorcière est spécialisée dans la magie occulte et la nécromancie, ce qui vous permet de construire une armée, d'utiliser des sorts d'os et de répandre des affaiblissements pour attaquer les ennemis à distance ou déclencher une épidémie.",
            "stats":"Intelligence",
            "Armes":"Batons et focus",
            "typeDeDegats":"Élémentaire et physique",
            "typeDeDefense":"Bouclier magique",
            "ascendense1":"Blood mage",
            "ascendense2":"Infernalist",
            "etat":"Classe disponible"

        },
        {
            "id":2,
            "name":"Magicienne",
            "description":"La sorcière est une classe basée sur l'intelligence qui se concentre sur la magie élémentaire, capable de tuer instantanément les hordes ennemies ou d'écraser les boss avec une seule capacité dévastatrice.",
            "stats":"Intelligence",
            "Armes":"Baguette",
            "typeDeDegats":"Élémentaire et physique",
            "typeDeDefense":"Bouclier magique",
            "ascendense1":"Chronomancer",
            "ascendense2":"Stormweaver",
            "etat":"Classe disponible"
        },
        {
            "id":3,
            "name":"Guerrier",
            "description":"Le Guerrier brille par son efficacité dans les coups lourds qui font onduler ses dégâts, ce qui en fait un excellent choix pour faire exploser les hordes ennemies et les boss.",
            "stats":"Force",
            "Armes":"Masses",
            "typeDeDegats":"Physique",
            "typeDeDefense":"Armure et bouclier",
            "ascendense1":"",
            "ascendense2":"",
            "etat":"Classe non disponible"
        },
        {
            "id":4,
            "name":"Maraudeur",
            "description":"Le Maraudeur est une classe barbare qui s'enfonce dans le combat à visage découvert. Leurs lourdes haches affûtées sont sûres de couper leurs adversaires en deux.",
            "stats":"Force",
            "Armes":"Hache",
            "typeDeDegats":"Élémentaire et physique",
            "typeDeDefense":"Armure et bouclier",
            "ascendense1":"Titan",
            "ascendense2":"Warbringer",
            "etat":"Classe disponible"
        },
        {
            "id":5,
            "name":"Ranger",
            "description":"Le Rôdeur est un spécialiste de l'arc qui utilise son agilité et ses capacités pour contrôler les foules ou éliminer les hordes et endommager les boss.",
            "stats":"Dexterité",
            "Armes":"Arc",
            "typeDeDegats":"Élémentaire",
            "typeDeDefense":"Esquive",
            "ascendense1":"Deadeye",
            "ascendense2":"Pathfinder",
            "etat":"Classe disponible"
        },
        {
            "id":6,
            "name":"Chasserese",
            "description":"La chasseresse est une classe polyvalente qui utilise ses capacités pour abattre les ennemis au corps à corps et à distance, ce qui facilite les dégâts grâce à ses options de mobilité et de portée.",
            "stats":"Dexterité",
            "Armes":"Lance",
            "typeDeDegats":"Élémentaire et physique",
            "typeDeDefense":"Esquive",
            "ascendense1":"",
            "ascendense2":"",
            "etat":"Classe non disponible"
        },
        {
            "id":7,
            "name":"Moine",
            "description":"Le moine est une classe complexe qui combine dextérité et intelligence pour se déplacer sur le champ de bataille avec un mélange d'attaques physiques fluides et de sorts élémentaires.",
            "stats":"Dextérité et intelligence" ,
            "Armes":"Batons",
            "typeDeDegats":"Élémentaire et physique",
            "typeDeDefense":"Esquive",
            "ascendense1":"Acolyte of Chayula",
            "ascendense2":"Invoker",
            "etat":"Classe disponible"
        },
        {
            "id":8,
            "name":"Ombre",
            "description":"L'Ombre est une classe rusée basée sur les égorgeurs et les voleurs. Ils utilisent leurs moments d'insaisissabilité et leurs poignards aiguisés pour éliminer leurs ennemis.",
            "stats":"Dextérité et intelligence",
            "Armes":"Dague",
            "typeDeDegats":"Élémentaire et physique",
            "typeDeDefense":"Esquive",
            "ascendense1":"",
            "ascendense2":"",
            "etat":"Classe non disponible"
        },
        {
            "id":9,
            "name":"Mercenaire",
            "description":"Le mercenaire peut utiliser plusieurs arbalètes et types de munitions pour faire face à toutes les situations à distance. Il peut détruire les boucliers ou les armures des ennemis avec des tirs rapides, bloquer les chemins avec un mur de glace ou tirer sur les boss pour les abattre.",
            "stats":"Force et dextérité",
            "Armes":"Baguette,Batons et focus",
            "typeDeDegats":"Élémentaire et physique",
            "typeDeDefense":"Esquive",
            "ascendense1":"Witchhunter",
            "ascendense2":"Gemling Legionnaire",
            "etat":"Classe disponible"
        },
        {
            "id":10,
            "name":"Duelliste",
            "description":"Le duelliste est une classe axée sur la finesse qui tranche les ennemis comme des rubans. Il utilise ses coups d'épée calculés pour laisser ses adversaires dans l'expectative.",
            "stats":"Force et dextérité",
            "Armes":"Épées",
            "typeDeDegats":"Élémentaire et physique",
            "typeDeDefense":"Esquive",
            "ascendense1":"",
            "ascendense2":"",
            "etat":"Classe non disponible"
        },
        {
            "id":11,
            "name":"Druide",
            "description":"Le druide est une classe de métamorphose qui allie force et intelligence. Sous forme humaine, le druide peut lancer des sorts pour endommager les ennemis à distance. Sous forme animale, il peut piétiner les hordes ennemies ou porter des coups dévastateurs de près.",
            "stats":"Force et intelligence",
            "Armes":"Sceptre",
            "typeDeDegats":"Élémentaire et physique",
            "typeDeDefense":"Bouclier magique",
            "ascendense1":"",
            "ascendense2":"",
            "etat":"Classe non disponible"
        },
        {
            "id":12,
            "name":"Templier",
            "description":"Le templier est une classe axée sur la foi qui tente d'invoquer la lumière sacrée et de frapper ses ennemis.",
            "stats":"Force et intelligence",
            "Armes":"Fléaux",
            "typeDeDegats":"Élémentaire et physique",
            "typeDeDefense":"Armure et bouclier",
            "ascendense1":"",
            "ascendense2":"",
            "etat":"Classe non disponible"
        }
    ],
    "gemmes":[
        {
            "id":1,
            "name":"gemme d'aptitude",
            "description":"Les gemmes d'aptitude sont des objets essentiels qui permettent d'utiliser des compétences variées, qu'elles soient offensives, défensives ou de soutien. Dans Path of Exile 2, chaque gemme d'aptitude représente une compétence spécifique que vous pouvez équiper dans des emplacements de gemmes disponibles sur vos armes et armures. Ces gemmes progressent avec l'expérience acquise, gagnant en puissance et en efficacité. Certaines gemmes offrent des attaques dévastatrices, d'autres invoquent des serviteurs ou déclenchent des effets stratégiques tels que des ralentissements ou des boucliers protecteurs. Associées aux gemmes de soutien, elles peuvent être modifiées pour ajuster leur comportement, ajouter des effets secondaires ou amplifier leurs dégâts, offrant une flexibilité et une personnalisation infinies pour s'adapter à votre style de jeu."
        },
        {
            "id":2,
            "name":"gemme de soutient",
            "description":"Les gemmes de soutien, comme leur nom l'indique, sont conçues pour modifier ou renforcer les effets des gemmes de compétence actives. Contrairement aux gemmes classiques, elles ne confèrent pas de compétences directement, mais ajoutent des effets passifs spécifiques aux compétences auxquelles elles sont liées. Dans Path of Exile 2, l'utilisation des gemmes de soutien a été repensée : elles s'insèrent directement dans les emplacements de gemmes des armes ou armures. Cela simplifie leur gestion en supprimant les liens entre les emplacements, tout en conservant une profondeur stratégique, car chaque combinaison de gemmes peut drastiquement transformer les compétences associées. Par exemple, une gemme de soutien peut augmenter les dégâts, modifier le comportement d'une compétence ou ajouter des effets supplémentaires comme des projectiles multiples ou des effets de contrôle."
        },
        {
            "id":3,
            "name":"gemme d'esprit",
            "description":"Dans Path of Exile 2, les gemmes d'esprit sont une nouveauté qui offrent des améliorations passives persistantes, telles que des buffs ou des invocations de serviteurs. Pour les activer, elles nécessitent une ressource appelée 'esprit', qui est réservée de manière permanente lors de leur utilisation."
        }
    ]
}